'''
파이썬 머신러닝을 위한 모듈
아나콘다를 사용. -> 파이썬 과학 계산용임 무거움 그래서 미니콘다를 사용
패키지 관리로 CONDA 사용
IDE로 주피터
데이터분석으로 판다스랑 넘파이 , matplotlib
'''


'''
머신러닝 : 기존의 데이터를 알고리즘을 사용하여 모델을 만들고 새로운 데이터에 모델을 적용하여 예측하는 방법
머신러닝 알고리즘과 모델을 배우는것이 핵심.

키 컨셉
모델 : 예측을 위한 수학 공식, 함수... etc
알고리즘 : 모델을 만들기 위한 과정.

모델에 영향을 주는 것들
y=ax+b
x: 보고싶어요 갯수, 독립변수
y: 실제 관객수

x를 feature라고 부름
머신러닝에서 데이터의 특징을 나타내는 변수
input변수, 테이블의 컬럼 모두 같은 말.

하나의 데이터 인스턴스(실제 데이터)는 feature vector로 표현

scalar는 이태릭체, vector는 소문자 볼드, Matrix는 대문자 볼드

Data table, sample : 전체 데이터 덩어리
attribute, feature : 항목들, 테이블에서 칼럼
instance, tuple : 한 명의 각각 데이터
feature vector : 컬럼의 데이터 셋
data : 가장 작은 분류의 데이터
'''